VTV02/STM32_Bare_Metal_CMSIS_I2C_ADLX345/Source/i2c.c
/*
 * i2c.c
 *
 *  Created on: Jun 18, 2024
 *      Author: VOVAN
 */
#include "i2c.h"
#include <stm32f411xe.h>

#define GPIOBEN		(1U<<1)
#define I2C1EN		(1U<<21)
#define I2C_100KHZ	80//0B 0101 0000 = 80 decimal
#define SD_MODE_MAX_RISE_TIME 17
#define CR1_PE		(1U<<0)

#define SR2_BUSY	(1U<<1)
#define CR1_START	(1U<<8)
#define SR1_SB		(1U<<0)
#define CR1_STOP	(1U<<9)
#define SR1_ADDR	(1U<<1)
#define SR1_TXE		(1U<<7)
#define CR1_ACK		(1U<<10)
#define SR1_RXNE	(1U<<6)
#define SR1_BTF		(1U<<2)
/*PB8 AS I2C1 SCL
 * PB9 AS I2C2 SDA*/

void I2C_Init(void)
{
	/*Enable clock access to GPIOB*/
	RCC->AHB1ENR|=GPIOBEN;
	/*Set PB8 PB9 mode to alternate function*/
	GPIOB->MODER&=~(1U<<16);
	GPIOB->MODER|=(1U<<17);

	GPIOB->MODER&=~(1U<<18);
	GPIOB->MODER|=(1U<<19);
	/*Set PB8 PB9 output type to open drain*/
	GPIOB->OTYPER|=(1U<<8);
	GPIOB->OTYPER|=(1U<<9);
	/*Enable pull up for PB8 and PB9, don't need external register*/
	GPIOB->PUPDR&=~(1U<<17);
	GPIOB->PUPDR|=(1U<<16);

	GPIOB->PUPDR&=~(1U<<19);
	GPIOB->PUPDR|=(1U<<18);

	/*Enable clock access to I2C1*/
	RCC->APB1ENR|=I2C1EN;
	/*I2C reset mode*/
	I2C1->CR1|=(1U<<15);
	/*Come out of reset mode*/
	I2C1->CR1&=~(1U<<15);
	/*Set peripheral clock frequency*/
	I2C1->CR2|=(1U<<4);//16MHz
	/*Set I2C to standard mode, 100Khz clock*/
	I2C1->CCR=I2C_100KHZ;
	/*Set the TRISE time*/
	I2C1->TRISE=SD_MODE_MAX_RISE_TIME;
	/*Enable I2C1 module*/
	I2C1->CR1|=CR1_PE;

}

void I2C1_byteRead(char saddr, char maddr, char* data)
{
	volatile int tmp;

	/*Wait until bus not busy*/
	while(I2C1->CR2 & SR2_BUSY){}

	/*Generate Start condition*/
	I2C1->CR1|=CR1_START;

	/*Wait until start flag is set*/
	while(!(I2C1->SR1&SR1_SB)){}

	/*Transmit slave address + Write*/
	I2C1->DR=saddr<<1;

	/*Wait until addr flag is set*/
	while(!(I2C1->SR1&SR1_ADDR)){}

	/*Clear addr flag*/
	tmp=I2C1->SR2;
	/*Send memory address*/
	I2C1->DR=maddr;
	/*Wait until transmitter empty*/
	while(!(I2C1->SR1&SR1_TXE)){}
	/*Generate Start condition*/
	I2C1->CR1|=CR1_START;
	/*Wait until start flag is set*/
	while(!(I2C1->SR1&SR1_SB)){}
	/*Transmit slave address*/
	I2C1->DR=saddr<<1|1;
	/*Wait until addr flag is set*/
	while(!(I2C1->SR1&SR1_ADDR)){}
	/*Disable Acknowledge*/
	I2C1->CR1&=~CR1_ACK;
	/*Clear addr flag*/
	tmp=I2C1->SR2;
	/*Generate Stop after data received*/
	I2C1->CR1|=CR1_STOP;
	/*Wait until RXNE flag is set*/
	while(!(I2C1->SR1&SR1_RXNE)){}

	/*Read data from DR*/
	*data++=I2C1->DR;

}

void I2C1_burstRead(char saddr, char maddr,int n, char* data)
{
	volatile int tmp;
	/*Wait until bus not busy*/
	while(I2C1->CR2 & SR2_BUSY){}
	/*Generate Start condition*/
	I2C1->CR1|=CR1_START;
	/*Wait until start flag is set*/
	while(!(I2C1->SR1&SR1_SB)){}
	/*Transmit slave address + Write*/
	I2C1->DR=saddr<<1;
	/*Wait until addr flag is set*/
	while(!(I2C1->SR1&SR1_ADDR)){}
	/*Clear addr flag*/
	tmp=I2C1->SR2;
	/*Wait until transmitter empty*/
	while(!(I2C1->SR1&SR1_TXE)){}
	/*Send memory address*/
	I2C1->DR=maddr;
	/*Wait until transmitter empty*/
	while(!(I2C1->SR1 & SR1_TXE)){}
	/*Generate Start condition*/
	I2C1->CR1|=CR1_START;
	/*Wait until start flag is set*/
	while(!(I2C1->SR1&SR1_SB)){}
	/*Transmit slave address*/
	I2C1->DR=saddr<<1|1;
	/*Wait until addr flag is set*/
	while(!(I2C1->SR1&SR1_ADDR)){}
	/*Clear addr flag*/
	tmp=I2C1->SR2;
	/*Enable Acknowledge*/
	I2C1->CR1|=CR1_ACK;
	while(n>0U)
	{
		/*if one byte*/
		if(n==1U)
		{
			/*Disable Acknowledge*/
			I2C1->CR1&=~CR1_ACK;

			/*Generate Stop after data received*/
			I2C1->CR1|=CR1_STOP;

			/*Wait until RXNE flag is set*/
			while(!(I2C1->SR1&SR1_RXNE)){}

			/*Read data from DR*/
			(*data++)=I2C1->DR;
			break;
		}
		else
		{
			/*Wait until RXNE flag is set*/
			while(!(I2C1->SR1&SR1_RXNE)){}
			/*Read data from DR*/
			(*data++)=I2C1->DR;
			n--;

		}
	}
}
void I2C1_burstWrite(char saddr, char maddr,int n, char* data)
{
	volatile int tmp;
	/*Wait until bus not busy*/
	while(I2C1->CR2 & SR2_BUSY){}
	/*Generate Start condition*/
	I2C1->CR1|=CR1_START;
	/*Wait until start flag is set*/
	while(!(I2C1->SR1&SR1_SB)){}
	/*Transmit slave address + Write*/
	I2C1->DR=saddr<<1;
	/*Wait until addr flag is set*/
	while(!(I2C1->SR1&SR1_ADDR)){}
	/*Clear addr flag*/
	tmp=I2C1->SR2;
	/*Wait until data register empty*/
	while(!(I2C1->SR1&SR1_TXE)){}
	/*Send memory address*/
	I2C1->DR=maddr;

	for(int i=0;i<n;i++)
	{
		/*Wait until data register empty*/
		while(!(I2C1->SR1&SR1_TXE)){}
		I2C1->DR=*data++;

	}
	/*Wait until transfer finish*/
	while(!(I2C1->SR1&SR1_BTF)){}
	/*Generate Stop after data received*/
	I2C1->CR1|=CR1_STOP;

}











